Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: བཙུན་པ་གཅེར་བུ་པ་འོད་སྲུང་དང་རུས་གཅིག་པ་འདི་ལས་ཅི་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས། བ་དྲུས་མས་བརྡུངས་ཏེ་བཀུམ་ལགས།
en: “Lord, what action did Nirgrantha Kinsman of the Kāśyapas take that ripened into his being kicked by a milk cow and killed?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་འདི་ཉིད་ཀྱིས་ལས་དེ་ལྟ་བུ་བྱས་ཤིང་བསྩགས་ཏེ།
en: “Monks,” the Blessed One explained, “such are the actions that he committed and accumulated: . . .”

source: འདི་སྔོན་གྱི་གཏམ་རྒྱུད་ནི་པུས་ཀ་ར་ས་རའི་གཏམ་རྒྱུད་ལས་འབྱུང་བ་བཞིན་དུ། མིང་པོ་བཞིས་སྲིང་མོ་བཞི་བསད་པའི་བར་དུ་རྒྱས་པར་བརྗོད་པར་བྱའོ། །
en: At this point his backstory should be told in detail according to the tale of Puṣkarasārin, up to the killing of the four sisters at the hands of their four brothers.

source: གསོལ་པ། བཙུན་པ་གཅེར་བུ་པ་འོད་སྲུང་དང་རུས་གཅིག་པས་ལས་ཅི་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་འདིས་བཅོམ་ལྡན་འདས་མཉེས་པར་བགྱིས་ཏེ། མི་མཉེས་པར་མ་བགྱིས་ལགས།
en: “What action did Nirgrantha Kinsman of the Kāśyapas take that ripened such that he pleased the Blessed One, and did not displease him?” they asked.

source: གསོལ་པ་བཙུན་པ། འདིས་སྨོན་ལམ་གང་དུ་བཏབ་ལགས།
en: “Lord, where did he make these prayers?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེདེའི་གྲགས་པ་ཀུན་ཏུ་རྒྱས་པར་གྱུར་ཏོ། །
en: “Monks,” the Blessed One recounted, “in times past, in this fortunate eon, when people lived as long as twenty thousand years and the tathāgata, the arhat, the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world, his fame spread far and wide.

source: དེ་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བཱ་རཱ་ཎ་སཱིར་གནས་བཅས་ཏེ། བདུད་རྩིའི་ཆར་འབེབས་ཤིང་བདུད་རྩིས་འགྲོ་བ་རྣམས་ཚིམ་པར་མཛད་དོ། །
en: “As the totally and completely awakened Buddha Kāśyapa dwelt in Vārāṇasī, he let fall a rain of nectar to satisfy living beings.

source: དེའི་ཚེ་ཡུལ་དེ་ན་བྲམ་ཟེའི་ཁྱེའུ་ཞིག་གནས་པ་དེས་ཀྱང་།
en: At that time there was a certain young brahmin also living in that region,

source: བཱ་རཱ་ཎ་སཱི་ན། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ཞེས་བྱ་བ་བདུད་རྩིའི་ཆར་འབེབས་ཏེ། བདུད་རྩིས་འགྲོ་བ་རྣམས་ཚིམ་པར་མཛད་དོ་ཞེས་ཐོས་སོ། །
en: and he heard that in Vārāṇasī the totally and completely awakened Buddha Kāśyapa was letting fall a rain of nectar to satisfy living beings.

source: ཐོས་ནས་ཀྱང་ཡུལ་དྲང་སྲོང་སྨྲ་བར་སོང་ནས། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་དེ་ག་ལ་བཞུགས་པ་དེར་སོང་སྟེ་
en: When he heard this he traveled to Ṛṣivadana and approached the totally and completely awakened Buddha Kāśyapa.

source: ཕྱིན་ནས། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས།
en: Upon his arrival he touched his head to the feet of the totally and completely awakened Buddha Kāśyapa

source: དེས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ལས་ཆོས་ཐོས་ནས་སྐྱབས་སུ་འགྲོ་བ་དང་། བསླབ་པའི་གཞི་རྣམས་བླངས་ནས་སོང་ངོ་། །
en: Having heard the Dharma from the totally and completely awakened Buddha Kāśyapa, he went for refuge, took the fundamental precepts, and then departed.

source: དེ་ནས་དེས་ཚེ་གཅིག་ཏུ་སྦྱིན་པ་དག་བྱིན་ཞིང་། བསོད་ནམས་དག་བྱས་ཏེ། སྐྱབས་སུ་འགྲོ་བ་དང་། བསླབ་པའི་གཞི་རྣམས་བསྲུང་ནས།
en: “After that he gave gifts, made merit, went for refuge, and maintained the fundamental precepts all his life.

source: འདི་ལྟར་བདག་གིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་ཚེ་གཅིག་ཏུ་སྐྱབས་སུ་འགྲོ་བ་དང་། བསླབ་པའི་གཞི་རྣམས་བསྲུངས་ཀྱང་། ཡོན་ཏན་གྱི་ཚོགས་ཅི་ཡང་མ་ཐོབ་ཀྱིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་བདག་གིས་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: ‘While I may not have attained any great virtues, still I have gone forth like this in the doctrine of the totally and completely awakened Buddha Kāśyapa and practiced pure conduct all my life. Therefore, may I please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.’

source: དེའི་ཚེ་བྲམ་ཟེར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་གཅེར་བུ་པ་འོད་སྲུང་དང་རུས་གཅིག་པ་འདི་ཁོ་ན་ཡིན་ཏེ།
en: The one who was that brahmin then is none other than Nirgrantha Kinsman of the Kāśyapas.

source: དེས་དེར་སྦྱིན་པ་དག་བྱིན་ཞིང་། བསོད་ནམས་དག་བྱས་ནས་ཚེ་གཅིག་ཏུ་སྐྱབས་སུ་འགྲོ་བ་དང་། བསླབ་པའི་གཞི་རྣམས་བསྲུང་ནས།
en: At that time he gave gifts, made merit, went for refuge, and maintained the fundamental precepts all his life.

source: འདིས་ང་མཉེས་པར་བྱས་ཏེ། མི་མཉེས་པར་མ་བྱས་སོ།། །།
en: that he has pleased me, and not displeased me.”

source: འོད་སྲུང་གཙོ་བོ་ཞེས་བྱ་བ་ནི།
en: The Story of Foremost Kāśyapa

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་རི་སུལ་ཞིག་ན་དྲང་སྲོང་འཁོར་ཁྲི་ཉིས་སྟོང་ཡོད་པ་ཞིག་གནས་ཏེ།
en: When the Blessed One was in Śrāvastī, on a ridge among the mountains there lived a certain sage who had twelve thousand disciples.

source: དྲང་སྲོང་དེ་ཡང་བསྟན་བཅོས་ཐམས་ཅད་ཀྱི་མཐར་ཕྱིན་པ།
en: The sage was a master of all the scriptures,

source: རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བ་ཞིག་སྟེ།
en: a person of great miracles and great power,

source: དེས་བྲམ་ཟེ་ཁྲི་ཉིས་སྟོང་པོ་དེ་དག་བསམ་གཏན་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་ལ་བཀོད་དོ། །
en: who had placed all twelve thousand of his disciples in the four meditative states and five superknowledges.

source: དེ་ནས་གང་གི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས། མཚོ་ཆེན་པོ་མ་དྲོས་པའི་ནང་དུ་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལུང་བསྟན་ནས། མཚོ་དེ་ཉིད་ཀྱི་ནང་ནས་འཁོར་ལྔ་བརྒྱ་དང་། ནམ་མཁའ་ལས་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་གཤེགས་སོ། །
en: The Blessed One, having given a definitive teaching on the ripening of karma beneath the waters of Lake Anavatapta, flew up out of Lake Anavatapta with a suite of five hundred attendants and traveled through the sky to the garden of Prince Jeta.

source: དྲང་སྲོང་དེ་འཁོར་དང་བཅས་པས་ཀྱང་བཅོམ་ལྡན་འདས་མཚོ་དེ་ཉིད་ཀྱི་ནང་ནས་ནམ་མཁའ་ལ་གཤེགས་པ་མཐོང་ངོ་། །
en: The sage and his retinue saw the Blessed One traveling through the sky with his suite of attendants,

source: མཐོང་མ་ཐག་ཏུ་བཅོམ་ལྡན་འདས་ལ་དགའ་བར་གྱུར་ནས། ཐམས་ཅད་བོར་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཕྱི་བཞིན་འབྲང་ཞིང་།
en: and no sooner had they seen the Blessed One than they felt a surge of joy toward him and left everything behind to become his followers.

source: དེ་དག་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་ཞུགས་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བཞུགས་པ་དེར་དོང་སྟེ་ལྷགས་ནས།
en: When they arrived at the garden of Prince Jeta they entered and went to see the Blessed One,

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: touched their heads to the Blessed One’s feet,

source: ཆོས་མཉན་པའི་ཕྱིར་སྤྱན་སྔར་འཁོད་དོ། །
en: and sat before him to listen to the Dharma.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དྲང་སྲོང་ཁྲི་ཉིས་སྟོང་པོ་དེ་རྣམས་ཀྱི་བསམ་པ་དང་། བག་ལ་ཉལ་དང་། ཁམས་དང་ཤེས་པ་དང་། རང་བཞིན་ཐུགས་སུ་ཆུད་ནས། དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: The Blessed One directly apprehended the thoughts, habitual tendencies, temperament, capacity, and nature of the twelve thousand sages, taught them the Dharma accordingly,

source: དེས་ན་དྲང་སྲོང་ཁྲི་ཉིས་སྟོང་པོ་དེ་རྣམས་ཀྱིས་སྟན་དེ་དག་ཉིད་ལ་འཁོད་བཞིན་དུ་བདེན་པ་རྟོགས་པའི་མོད་ལ་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་སོ། །
en: and all twelve thousand sages, realizing the truths, instantly manifested the resultant state of non-return right where they sat.

source: དྲང་སྲོང་གཙོ་བོ་དེས་ནི་ཐོས་པས་རྒྱགས་ཤིང་དྲེགས་པས་ཅི་ཡང་མ་ཐོབ་བོ། །
en: But due to his arrogance and pride about his learning, the head sage attained nothing at all.

source: དེ་ནས་དྲང་སྲོང་ཁྲི་ཉིས་སྟོང་པོ་དེ་རྣམས་སྟན་ལས་ལངས་ཏེ།
en: The twelve thousand sages rose from their seats,

source: བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས།
en: drew down the right shoulder of their upper garments,

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ།
en: bowed toward the Blessed One with palms pressed together,

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: and requested the Blessed One,

source: བཙུན་པ་བདག་ཅག་ལེགས་པ་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་བྱུང་བ་དང་། བསྙེན་པར་རྫོགས་ཤིང་དགེ་སློང་གི་དངོས་པོ་འཐོབ་ཏུ་རུང་ན།
en: “Lord, if permitted we wish to go forth in the Dharma and Vinaya so well spoken, complete our novitiates, and achieve full ordination.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དྲང་སྲོང་ཁྲི་ཉིས་སྟོང་པོ་དེ་དག་ལ་དགེ་སློང་ཚུར་ཤོག་ཅེས་བྱ་བའི་ཚིག་གིས་རབ་ཏུ་ཕྱུང་སྟེ།
en: With the words “Come, join me, monks!” the Blessed One led all twelve thousand sages to go forth as novices,

source: བསྙེན་པར་རྫོགས་པར་མཛད་ནས།
en: conferred on them full ordination,

source: དེ་རྣམས་ལ་ལུང་ཡང་ཕོག་སྟེ།
en: and instructed them.

source: དེ་རྣམས་ཀྱིས་ཀྱང་བརྩོན་པ་དང་། བསྒྲུབ་པ་དང་། འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: Casting away all afflictive emotions through diligence, practice, and effort, they manifested arhatship.

source: དྲང་སྲོང་གཙོ་བོ་དེ་ནི་རབ་ཏུ་བྱུང་ཡང་ཅི་ཡང་མ་ཐོབ་བོ། །
en: The head sage went forth along with them, but once again he attained nothing at all.

source: དེ་ནས་དེས་དེ་ཐོས་ནས་འབད་པ་ལ་ཞུགས་ཏེ། དེས་རིང་པོ་མ་ལོན་པར་སྡེ་སྣོད་གསུམ་ལོབས་ནས།
en: Hearing of their accomplishment, he studied and began to make effort such that before long he had mastered the Tripiṭaka,

source: རིག་པ་དང་གྲོལ་བའི་སྤོབས་པ་དང་ལྡན་པའི་ཆོས་སྨྲ་བར་གྱུར་ཏོ། །
en: and become a proponent of the Dharma with all the eloquence of wisdom and freedom.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེའི་བློ་སྐྱེས་པ།
en: One day the thought came to him,

source: བདག་གིས་སེམས་ཅན་སྟོང་ཕྲག་དུ་མ་དག་ལ་ཆོས་སྟོན་ལ་བདག་ཉིད་ནི་ཆོས་སྟོན་པར་མི་འདོད་དེ།
en: “I’ve taught the Dharma to thousands upon thousands of beings, but I am not considered a Dharma teacher.

source: བདག་གི་གྲོགས་པོ་འདི་དག་ཐམས་ཅད་ཀྱིས་དགྲ་བཅོམ་པ་ཉིད་ཐོབ་ལ་བདག་གིས་ནི་དེ་ཐོས་ནས་ཅི་བྱ་གཏོལ་མེད་པར་གྱུར་ཏེ།
en: Since hearing that all my friends achieved arhatship I’m not sure what to do.

source: ཁྱད་པར་ཅི་ཡང་མ་ཐོབ་ཀྱིས།
en: I haven’t achieved anything of significance.

source: བདག་གིས་མཉན་པ་དང་། བསམ་གཏན་བཏང་ལ་རེ་ཞིག་བསྒྲིམ་པར་བྱའོ་སྙམ་ནས།
en: I will put aside study and meditation for a while, and just concentrate on this.”

source: དེས་ཐོས་པ་དེ་ཉིད་སེམས་པ་དང་། འཇལ་བ་དང་ཉེ་བར་བརྟགས་པས། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ཏེ།
en: He reflected on all that he had learned, pondered it, thought it through, cast away all afflictive emotions, and manifested arhatship.

source: བཙུན་པ་དྲང་སྲོང་དེ་ཐོས་པའི་རྒྱགས་པས་དྲེགས་ནས་ཅི་ཡང་མ་ཐོབ་ལ།
en: “Lord, tell us why, due to his arrogance and pride about his learning, the head sage did not achieve anything,

source: སླད་ཀྱིས་ཐོས་པ་དེ་ཉིད་སེམས་པ་དང་། འཇལ་བ་དང་། ཉེ་བར་བརྟགས་པས། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནསདགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་པ་ལ་གཟིགས།
en: and then by reflecting on all he had learned, pondering it, and thinking it through, he cast away all afflictive emotions and manifested arhatship.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ད་ལྟར་འབའ་ཞིག་མ་ཡིན་ཏེ། འདས་པའི་དུས་ན་ཡང་འདིས་སེམས་པ་དང་འཇལ་བ་དང་། བརྟགས་པས་བསམ་གཏན་བཞི་དང་མངོན་པར་ཤེས་པ་ལྔ་ཅི་ལྟར་བསྐྱེད་པ་དེ་ཉོན་ཅིག །
en: “Not only now,” the Blessed One explained, “but in times past as well, and in the same way, he reflected, pondered, and thought until he generated the four meditative states and five superknowledges. Listen well!

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། རི་ཁྲོད་ཅིག་ན་བྲམ་ཟེ་འོད་སྲུང་གཙོ་བོ་ཞེས་བྱ་བ་ཞིག་གནས་ཏེ།
en: “Monks, in times gone by, a certain brahmin named Foremost Kāśyapa was living in the wilderness.

source: ཕྱི་ཞིག་ན་དེ་རྩ་བ་དང་། འབྲས་བུ་དག་གི་དོན་ལ་རིའི་སུལ་ཞིག་ཏུ་སོང་བ་ལས། དེས་དེར་དྲང་སྲོང་ཁྲི་ཉིས་སྟོང་མཐོང་ནས།
en: One day, in search of roots and fruit, he went out onto the mountainside, where he saw twelve thousand sages.

source: མཐོང་མ་ཐག་ཏུ་དེ་དག་ལ་ཤིན་ཏུ་དགའ་བར་གྱུར་ནས། དེས་བསམས་པ།
en: Elated at the sight of them, he thought,

source: བདག་ནི་ཁྱིམ་གྱི་ཆོས་ལ་གནས་ལ། འདི་རྣམས་ནི་ཁྱིམ་གྱི་གནས་ནས་ངེས་པར་བྱུང་བ་ལས་ན། འདི་རྣམས་ནི་འཁོར་བ་ལས་གྲོལ་བ་ཡིན་གོར་མ་ཆག་གིས་མ་ལ་བདག་ཀྱང་འདི་ཁོ་ནའི་ཐད་དུ་རབ་ཏུ་འབྱུང་བར་བྱའོ་སྙམ་ནས།
en: ‘While I have been leading the life of a householder, they have gone forth from household life, and consequently will be liberated from saṃsāra. I too shall go forth in their very presence!’

source: དེས་ཐམས་ཅད་བོར་ཏེ། དྲང་སྲོང་དེ་དག་གི་ཐད་དུ་རབ་ཏུ་བྱུང་སྟེ།
en: With this thought he left everything behind to go forth in the sages’ presence,

source: དེ་དེར་སོང་ནས་བསྟན་བཅོས་ཐམས་ཅད་ཁོང་དུ་ཆུད་པར་གྱུར་ཏོ། །
en: and after joining them he gained perfect comprehension of all fields of knowledge.

source: དེ་ནས་ཕྱི་ཞིག་ན་དྲང་སྲོང་གཙོ་བོ་དེ་ཤི་ནས། བྲམ་ཟེའི་ཁྱེའུ་ཁྲི་ཉིས་སྟོང་པོ་དེ་རྣམས་དྲང་སྲོང་དེ་ཤི་བའི་ཕྱིར། ཤིན་ཏུ་མྱ་ངན་བྱེད་ཅིང་སྡུག་བསྔལ་ལ་སྨྲེ་སྔགས་འདོན་པར་བྱེད་དོ། །
en: “One day the chief sage died, and the twelve thousand young brahmins began to grieve, wailing in misery and lamenting the sage’s death.

source: དེ་ནས་འོད་སྲུང་གཙོ་བོ་དེས་དེ་དག་ལ་སྨྲས་པ།
en: Foremost Kāśyapa said to them,

source: བྲམ་ཟེའི་ཁྱེའུ་དག་ཧ་ཅང་མྱ་ངན་མ་བྱེད་ཅིག །
en: ‘Young brahmins, do not mourn so.

source: སྨྲེ་སྔགས་འདོན་པར་མ་བྱེད་ཅིག་དང་།
en: Do not lament.

source: ངས་ཁྱོད་ཀྱི་དགོས་པ་ཐམས་ཅད་སྦྱར་བར་བྱའོ་ཞེས་བྱས་ནས།
en: I shall provide for all your needs.’

source: དེས་བྲམ་ཟེའི་ཁྱེའུ་ཁྲི་ཉིས་སྟོང་པོ་དེ་དག་ཐམས་ཅད་བསྡུས་ཏེ། དེ་དག་ལ་ཡིད་ལ་བྱེད་པའི་ལུང་ཡང་ཕོག་ནས། དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་བསམ་གཏན་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་བསྐྱེད་དོ། །
en: He called together all twelve thousand young brahmins, and, after giving them instructions to ponder, they too generated the four meditative states and the five superknowledges.

source: དེ་ནས་ཕྱི་ཞིག་ན་འོད་སྲུང་གཙོ་བོས་བསམས་པ་བདག་གི་སློབ་མ་འདི་རྣམས་ཀྱིས་ནི་བདག་གི་ཡིད་ལ་བྱེད་པས་ཆོས་འདི་ལྟ་བུ་རྟོགས་པར་གྱུར་ལ།
en: “Some time later, Foremost Kāśyapa thought, ‘My disciples have realized all the instructions that I myself have pondered, but

source: བདག་ནི་ཐོས་པའི་རྒྱགས་པས་དྲེགས་པས་ཅི་ཡང་མ་ཐོབ་ནབདག་ལ་ཐོས་པ་འདི་ཅི་དགོས་སྙམ་ནས།
en: what use are my studies to me if, because of arrogance and pride about them, I have not achieved anything?’

source: དེས་ཀྱང་སེམས་པ་དང་། འཇལ་བ་དང་། ཉེ་བར་བརྟགས་པས། བསམ་གཏན་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་བསྐྱེད་དོ། །
en: Then, by reflecting on all he had learned, pondering it, and thinking it through, he generated the four meditative states and the five superknowledges.

source: དེའི་ཚེ་འོད་སྲུང་གཙོ་བོར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི། དྲང་སྲོང་འདི་ཁོ་ན་ཡིན་ཏེ།
en: The one who was Foremost Kāśyapa then is none other than this sage.

source: དེའི་ཚེ་ཡང་འདི་ཐོས་པའི་རྒྱགས་པས་དྲེགས་པས་ཅི་ཡང་མ་ཐོབ་ལ།
en: At that time, because of his arrogance and pride, he did not achieve anything,

source: ཕྱིས་ཐོས་པ་དེ་ཉིད་སེམས་པ་དང་འཇལ་བས་ཉེ་བར་བརྟགས་པས། བསམ་གཏན་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་བསྐྱེད་དོ། །
en: and then, by reflecting on all he had learned, pondering it, and thinking it through, he generated the four meditative states and the five superknowledges.

source: ད་ལྟར་ཡང་འདི་ཐོས་པའི་རྒྱགས་པས་དྲེགས་པས་སྔར་ཅི་ཡང་མ་ཐོབ་པ་ལས།
en: Now, as well, because of his arrogance and pride he did not achieve anything,

source: ཕྱིས་ཐོས་པ་དེ་ཉིད་སེམས་པ་དང་། འཇལ་བ་དང་། ཉེ་བར་བརྟགས་པས། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེདགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: and then, by reflecting on all he had learned, pondering it, and thinking it through, he cast away all afflictive emotions and manifested arhatship.”

source: བཙུན་པ་དྲང་སྲོང་འཁོར་དང་བཅས་པ་འདི་རྣམས་ཀྱིས་ལས་ཅི་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས། འདི་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་མཉེས་པར་བགྱིས་ཏེ། མི་མཉེས་པར་མ་བགྱིས་ལ།
en: “What action did the sage and his disciples take that ripened such that they pleased the Blessed One, did not displease him,

source: བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་དུ་བགྱིས་ལགས།
en: went forth in the doctrine of the Blessed One, cast away all afflictive emotions, and manifested arhatship?”

source: གསོལ་པ། བཙུན་པ་འདི་རྣམས་ཀྱིས་སྨོན་ལམ་གང་དུ་བཏབ་ལགས།
en: “Lord, where did they make these prayers?”

source: བཀའ་སྩལ་པ། དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་བཞི་ཁྲི་ཐུབ་པ་ན། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཁོར་བ་འཇིག་ཅེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: “Monks,” the Blessed One recounted, “in times past, in this fortunate eon, when people lived as long as forty thousand years, and the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Krakucchanda was in the world,

source: གང་གི་ཚེ་དེ་སངས་རྒྱས་ཀྱི་ཕྲིན་ལས་ཐམས་ཅད་མཛད་ནས། ཕུང་པོ་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས།
en: Krakucchanda carried out all the activities of a buddha and passed beyond all sorrow into the realm of nirvāṇa without any remainder of the aggregates.

source: རྒྱལ་པོ་མཛེས་ལྡན་གྱིས་དེའི་སྐུ་གདུང་ལ་མཆོད་པ་བྱས་ཏེ།
en: King Śobha performed a pūjā for his remains.

source: སྐུ་གདུང་གི་མཆོད་རྟེན་བརྩིགས་ནས།
en: He built a stūpa for his remains,

source: མཆོད་རྟེན་དེ་ལ་མཆོད་པ་ཆེན་པོ་བྱས་ཏེ།
en: made extensive offerings to the stūpa,

source: མཆོད་རྟེན་གྱི་དུས་སྟོན་གྱི་ལུགས་བཏོད་དོ། །
en: and inaugurated the traditional festival of the stūpa.

source: དེ་ནས་ཕྱི་ཞིག་ན་མཆོད་རྟེན་དེའི་མཆོད་རྟེན་གྱི་དུས་སྟོན་ལ་བབ་པ་ན། རྒྱལ་པོ་མཛེས་ལྡན་གྱི་ཁམས་སུ་གཏོགས་པ། རི་ཁྲོད་ཀྱི་རྒྱལ་པོ་འཁོར་ཁྲི་ཉིས་སྟོང་དང་ལྡན་པ་ཞིག་གིས་ཀྱང་།
en: “When the time came for the traditional festival of the stūpa, in the realm of King Śobha there was a certain ruler from the wilderness who had twelve thousand attendants,

source: མཆོད་པའི་ལས་ལ་བརྩོན་པར་བྱས་ནས། སྨོན་ལམ་བཏབ་པ།
en: and he likewise put great effort into making offerings to the stūpa, and prayed,

source: དགེ་བའི་རྩ་བ་འདིས་བདག་གང་དང་གང་དུ་སྐྱེ་བར་འགྱུར་བ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེ་བར་ཤོག་ཤིག །
en: ‘By the root of this virtue, wherever I am born, may it be into a family of great means, prosperity, and wealth.

source: སྟོན་པ་འདི་དང་འདྲ་བའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནསཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: Going forth in the doctrine of a teacher just like this one may I cast away all afflictive emotions, and manifest arhatship.’

source: དེ་ནས་ཞབས་འབྲིང་བ་རྣམས་ཀྱིས་དེ་མཐོང་ནས་དྲིས་པ།
en: “When they saw this his attendants asked,

source: ལྷ་གཅིག་གིས་སྨོན་ལམ་ཅི་བཏབ་ལགས།
en: ‘Your Majesty, what did you pray?’

source: དེ་ནས་རྒྱལ་པོས་ཀྱང་དེ་དག་ལ་རྒྱས་པར་བསྙད་དོ། །
en: and the king told them in detail.

source: དེ་ནས་ཞབས་འབྲིང་བ་རྣམས་ཀྱིས་སྨྲས་པ།
en: Then his attendants themselves prayed,

source: བདག་ཅག་གིས་ཀྱང་ལྷ་གཅིག་ལས་བརྟེན་ཏེ། སྟོན་པ་འདི་འདྲ་བ་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: ‘May we also, by entrusting ourselves to His Majesty, please and not displease a teacher just like this one.

source: དེའི་ཚེ་རི་ཁྲོད་ཀྱི་རྒྱལ་པོར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་དྲང་སྲོང་འདི་ཁོ་ན་ཡིན་ནོ། །
en: The one who was that ruler from the wilderness then is none other than this sage.

source: དེའི་ཚེ་འཁོར་ཁྲི་ཉིས་སྟོང་པོར་གྱུར་པ་གང་ཡིན་པ་དེ་དག་ནི། བྲམ་ཟེ་ཁྲི་ཉིས་སྟོང་པོ་འདི་དག་ཁོ་ན་ཡིན་ཏེ།
en: Those who were his twelve thousand attendants are now none other than these twelve thousand brahmins.

source: དེར་མཆོད་རྟེན་དེ་ལ་བཀུར་སྟི་བྱས་ནས། སྨོན་ལམ་བཏབ་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས། གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ནས།
en: At that time the actions of venerating the stūpa and saying that prayer ripened such that wherever they were born, it was into a family of great means, prosperity, and wealth,

source: འདིས་ང་མཉེས་པར་བྱས་ཏེ། མི་མཉེས་པར་མ་བྱས་ལ། ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: and such that they pleased me, did not displease me, went forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.

source: དྲང་སྲོང་ཁྲི་ཉིས་སྟོང་པོ་འདི་རྣམས་ཀྱིས་ཀྱང་། དེ་ཉིད་ལ་བརྟེན་ནས། འདི་རྣམས་ཀྱིས་ང་མཉེས་པར་བྱས་ཏེ། མི་མཉེས་པར་མ་བྱས་ལ།
en: “So too all twelve thousand sages, by entrusting themselves to me, have pleased me, not displeased me,

source: ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: gone forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.

source: དེར་འདི་དག་ཐམས་ཅད་ཀྱིས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་དེ། དབང་པོ་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱས་པ་དེས་ན། ད་ལྟར་རྣམ་པར་གྲོལ་བར་གྱུར་ཏོ།། །།
en: After practicing pure conduct all their lives then, their faculties ripened, and now they have been liberated.”

source: གླང་ཆེན་གནས་ཞེས་བྱ་བ་ནི་གླེང་གཞི་རྒྱལ་པོའི་ཁབ་ན་བཞུགས་ཏེ། དེའི་ཚེ་རྒྱལ་པོའི་ཁབ་ཀྱི་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོའི་གླང་པོ་ཆེའི་བླ། གླང་ཆེན་སྙིང་པོ་ཞེས་བྱ་བ།
en: When the Blessed One was in Rājagṛha, there lived in Rājagṛha a certain elephant trainer of King Bimbisāra’s whose name was Elephant Heart.

source: ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ། ཡོངས་སུ་འཛིན་པ་མང་བ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་མཉམ་པ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་འགྲན་པ་ཞིག་གནས་པ་དེས།
en: He was prosperous and wealthy, a person of vast and magnificent means, endowed with the wealth of Vaiśravaṇa—with wealth to rival Vaiśravaṇa’s.

source: ཐབས་ཟླར་བབ་པ་ལས་ཆུང་མ་བླངས་ནས། དེ་དེ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་དོ། །
en: When the time came for him to marry he took a wife, and they enjoyed themselves and coupled.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས། དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་། བུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་ཏེ།
en: One day his wife conceived, and after nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful.

source: དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ནས། ཁྱེའུ་འདིའི་མིང་ཅི་སྐད་གདགས་ཞེས་མིང་འདོགས་པར་བྱེད་དེ།
en: At the elaborate feast celebrating his birth they asked, “What name should we give this child?”

source: ཁྱེའུ་འདི་རྒྱུ་སྐར་ནག་པ་ལས་སྐྱེས་ལ། གཅིག་ཏུ་ན་གླང་པོ་ཆེའི་བླ་གླང་ཆེན་སྙིང་པོའི་བུ་ཡིན་པས་ན། ཁྱེའུ་འདིའི་མིང་ནག་པ་གླང་ཆེན་གནས་ཞེས་གདགས་སོ་ཞེས་ཟེར་རོ། །
en: and they named him, saying, “Since this child was born to Elephant Heart, the elephant trainer, under the constellation Citra , his name will be Citra Mounted on an Elephant.”

source: དེ་ནས་ཁྱེའུ་ནག་པ་གླང་ཆེན་གནས། འོ་མ་དང་། ཞོ་དང་། མར་དང་། ཞུན་མར་དང་། མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ནས།
en: They reared young Citra Mounted on an Elephant on milk, yogurt, butter, ghee, and milk solids.

source: དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ། ཁྱེའུ་དེ་ཡི་གེ་སློབ་ཏུ་བཅུག་སྟེ། རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བའི་རྒྱལ་པོ་རྣམས་ཀྱི་བཟོའི་གནས་དང་། ལས་ཀྱི་གནས་ཐ་དད་པ་འདི་ལྟ་སྟེ།
en: As the young man grew up, they made him study letters, and trained him in all the different fields of craft and skill in which duly consecrated rulers of the royal caste train, such as
